{"id":"121342","title":"Williams Formula 1 team sets up wet weather form working group","shortTitle":"Williams sets up wet form focus group","series":"F1","seriesId":"5","datePublished":"2015-10-15T12:54:47+00:00","dateCreated":"2015-10-15T12:54:47+00:00","dateModified":"2015-10-15T12:54:47+00:00","authors":["Lawrence Barretto"],"canonicalURL":"http:\/\/www.autosport.com\/news\/report.php\/id\/121342","keywords":["F1"],"excerpt":"The Williams Formula 1 team has set up a working group dedicated to understanding why its car suffers in low-speed and wet conditions","body":"![F1](http:\/\/scaled.images.autosport.com\/eca\/ecafc982da2737960e41e7d296e82a101.jpg)\n\nThe Williams Formula 1 team has set up a working group dedicated to understanding why its car suffers in low-speed and wet conditions.\n\nWilliams has suffered a tendency to understeer heavily at low speed and as a result, it struggled in Monaco and Hungary earlier this season.\n\nWhen the rain came during the British Grand Prix, Felipe Massa and Valtteri Bottas went backwards having run Mercedes close at the front in the dry.\n\nSince the race in Monaco, Williams has been working hard to understand the problems, with the team using the wet second practice in Russia to try some solutions.\n\n\"We made a conscious decision, which we have been working on since Monaco, to look at our low-speed performance deficit,\" said Williams performance chief Rob Smedley.\n\n\"As part of that work, we have also been looking at performance deficit in the wet.\n\n\"At Silverstone, we were keeping pace with Mercedes, they were a little quicker but nothing extraordinary and as soon as it rained, Red Bull and Ferrari were significantly quicker than us.\n\n\"In Austria, in P3, there was a similar situation where it was an extreme wet track, we put the extreme wet tyres on and suddenly lost about three per cent of pace.\n\n\"That's been quite a worry for me personally and everyone else.\n\n\"So we put together a working group looking at trying to understand our problems, which is mainly tyre-related, in those conditions - in low-speed conditions or in the wet.\n\n\"Because of that, we were waiting for an opportunity where it rained, when we knew it wouldn't rain for the rest of the weekend, so we can throw tyres at it. That's basically what we were doing on Friday.\"\n\nMassa was the pacesetter among the limited number of driver who completed flying laps during [the rain-affected Friday session](http:\/\/beta.autosport.com\/news\/report.php\/id\/121234) in Russia."}