{"id":"121340","title":"Bernie Ecclestone says Red Bull's Formula 1 future is now \"sorted\"","shortTitle":"Ecclestone: Red Bull future is 'sorted'","series":"F1","seriesId":"5","datePublished":"2015-10-15T10:21:40+00:00","dateCreated":"2015-10-15T10:21:40+00:00","dateModified":"2015-10-15T10:21:40+00:00","authors":["Dieter Rencken and Glenn Freeman"],"canonicalURL":"http:\/\/www.autosport.com\/news\/report.php\/id\/121340","keywords":["F1"],"excerpt":"Red Bull's future in Formula 1 is now \"sorted\" according to Bernie Ecclestone, who is adamant the company will not be withdrawing at the end of the 2015 season","body":"![F1](http:\/\/scaled.images.autosport.com\/98f\/98fa74dae27ffb167e9acd6f8c196f261.jpg)\n\nRed Bull's future in Formula 1 is now \"sorted\" according to Bernie Ecclestone, who is adamant the company will not be withdrawing at the end of the 2015 season.\n\nSenior figures from Red Bull, including owner Dietrich Mateschitz, have made repeated threats to pull both of its teams out of F1 if it cannot find competitive engines for Red Bull Racing and Toro Rosso. [**DIETER RENCKEN: Face to face with Bernie Ecclestone**](http:\/\/beta.autosport.com\/premium\/feature\/6721\/face-to-face-with-bernie-ecclestone)\n\n*Autosport* understands [Red Bull reopened talks with Renault](http:\/\/beta.autosport.com\/news\/report.php\/id\/121233) over the Russian Grand Prix weekend, following what appeared to be a terminal breakdown in its relationship with the French manufacturer during a second tough season for the partnership.\n\nEcclestone admits he felt the possibility of Red Bull leaving was legitimate, but he believes the matter has now been resolved.\n\nWhen asked if he thought Red Bull would pull out, Ecclestone told *Autosport*: \"I think now, with what's happened, no.\n\n\"But before, I thought yes.\"\n\nAsked to clarify what had happened to make him so confident, he added: \"Things are sorted.\"\n\nRed Bull made clear over the summer it was keen to replace Renault with a more competitive engine supplier, but approaches to Mercedes and Ferrari were unsuccessful.\n\nIt had hoped a Mercedes engine could be badged by Aston Martin, but the deal was rejected by the German manufacturer at board level.\n\nMeanwhile Toro Rosso is now [in talks with Ferrari to land a supply of year-old power units](http:\/\/beta.autosport.com\/news\/report.php\/id\/121254) for next season, a deal that should be made possible by teams' unanimous support for a regulation change allowing manufacturers [to offer different engine specifications](http:\/\/beta.autosport.com\/news\/report.php\/id\/121328).\n\nEcclestone also confirmed that Red Bull's long-term commitment to F1 means contracts are in place that would prove costly to break.\n\n\"Look, if he [Mateschitz] says he's leaving and he leaves, he knows it's going to be very expensive,\" he said.\n\nHe also added that smaller teams \"who are complaining\" about the terms of their own F1 deals couldn't commit to deals including such penalty clauses.\n\n**AUTOSPORT SAYS...**  \n*Ian Parkes - [@ianparkesf1](http:\/\/www.twitter.com\/ianparkesf1)*\n\nF1 supremo Bernie Ecclestone positively revelled in the attention that came his way over the course of the Russian Grand Prix weekend.\n\nWith the futures of Red Bull Racing and Toro Rosso on the line, the 84-year-old flitted from one team's hospitality building to another at the Sochi Autodrom, conducting meeting after meeting.\n\nIn between times Ecclestone was being badgered by the media for updates, something he generally doesn't enjoy, but on this occasion he appeared to bask in the spotlight, coming across as the white-haired knight riding to the rescue.\n\nWhen something is \"sorted\" in Ecclestone's eyes it generally means he is dealing with it in his own inimitable way, that the wheels are certainly in motion but that a signed-on-the-dotted line conclusion has yet to be reached.\n\nEven Red Bull team boss Christian Horner was surprised to learn of the upbeat nature of Ecclestone's remarks on Saturday, particularly given on the Friday he indicated he was as far away as ever in terms of landing a deal.\n\nIn F1, though, when Ecclestone is on the case a situation can move remarkably quickly, with a few twists and turns likely to be in the offing yet before \"sorted\" becomes cast-iron resolved.![F1](http:\/\/scaled.images.autosport.com\/d46\/d465d8320565c33816732b58f8562e411.jpg)"}